Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ128GA008.h
#define _ODCA_ODA10_POSITION                     0x0000000A
#define _ODCA_ODA10_MASK                         0x00000400
#define _ODCA_ODA10_LENGTH                       0x00000001

#define _ODCA_ODA14_POSITION                     0x0000000E
#define _ODCA_ODA14_MASK                         0x00004000
#define _ODCA_ODA14_LENGTH                       0x00000001

#define _ODCA_ODA15_POSITION                     0x0000000F
#define _ODCA_ODA15_MASK                         0x00008000
#define _ODCA_ODA15_LENGTH                       0x00000001

#define _ODCB_ODB0_POSITION                      0x00000000
#define _ODCB_ODB0_MASK                          0x00000001
#define _ODCB_ODB0_LENGTH                        0x00000001

#define _ODCB_ODB1_POSITION                      0x00000001
#define _ODCB_ODB1_MASK                          0x00000002
#define _ODCB_ODB1_LENGTH                        0x00000001

#define _ODCB_ODB2_POSITION                      0x00000002
#define _ODCB_ODB2_MASK                          0x00000004
#define _ODCB_ODB2_LENGTH                        0x00000001

#define _ODCB_ODB3_POSITION                      0x00000003
#define _ODCB_ODB3_MASK                          0x00000008
#define _ODCB_ODB3_LENGTH                        0x00000001

#define _ODCB_ODB4_POSITION                      0x00000004
#define _ODCB_ODB4_MASK                          0x00000010
#define _ODCB_ODB4_LENGTH                        0x00000001

#define _ODCB_ODB5_POSITION                      0x00000005
#define _ODCB_ODB5_MASK                          0x00000020
#define _ODCB_ODB5_LENGTH                        0x00000001

#define _ODCB_ODB6_POSITION                      0x00000006
#define _ODCB_ODB6_MASK                          0x00000040
#define _ODCB_ODB6_LENGTH                        0x00000001

#define _ODCB_ODB7_POSITION                      0x00000007
#define _ODCB_ODB7_MASK                          0x00000080
#define _ODCB_ODB7_LENGTH                        0x00000001

#define _ODCB_ODB8_POSITION                      0x00000008
#define _ODCB_ODB8_MASK                          0x00000100
#define _ODCB_ODB8_LENGTH                        0x00000001

#define _ODCB_ODB9_POSITION                      0x00000009
#define _ODCB_ODB9_MASK                          0x00000200
#define _ODCB_ODB9_LENGTH                        0x00000001

#define _ODCB_ODB10_POSITION                     0x0000000A
#define _ODCB_ODB10_MASK                         0x00000400
#define _ODCB_ODB10_LENGTH                       0x00000001

#define _ODCB_ODB11_POSITION                     0x0000000B
#define _ODCB_ODB11_MASK                         0x00000800
#define _ODCB_ODB11_LENGTH                       0x00000001

#define _ODCB_ODB12_POSITION                     0x0000000C
#define _ODCB_ODB12_MASK                         0x00001000
#define _ODCB_ODB12_LENGTH                       0x00000001

#define _ODCB_ODB13_POSITION                     0x0000000D
#define _ODCB_ODB13_MASK                         0x00002000
#define _ODCB_ODB13_LENGTH                       0x00000001

#define _ODCB_ODB14_POSITION                     0x0000000E
#define _ODCB_ODB14_MASK                         0x00004000
#define _ODCB_ODB14_LENGTH                       0x00000001

#define _ODCB_ODB15_POSITION                     0x0000000F
#define _ODCB_ODB15_MASK                         0x00008000
#define _ODCB_ODB15_LENGTH                       0x00000001

#define _ODCC_ODC1_POSITION                      0x00000001
#define _ODCC_ODC1_MASK                          0x00000002
#define _ODCC_ODC1_LENGTH                        0x00000001

#define _ODCC_ODC3_POSITION                      0x00000003
#define _ODCC_ODC3_MASK                          0x00000008
#define _ODCC_ODC3_LENGTH                        0x00000001

#define _ODCC_ODC12_POSITION                     0x0000000C
#define _ODCC_ODC12_MASK                         0x00001000
#define _ODCC_ODC12_LENGTH                       0x00000001

#define _ODCC_ODC13_POSITION                     0x0000000D
#define _ODCC_ODC13_MASK                         0x00002000
#define _ODCC_ODC13_LENGTH                       0x00000001

#define _ODCC_ODC14_POSITION                     0x0000000E
#define _ODCC_ODC14_MASK                         0x00004000
#define _ODCC_ODC14_LENGTH                       0x00000001

#define _ODCC_ODC15_POSITION                     0x0000000F
#define _ODCC_ODC15_MASK                         0x00008000
#define _ODCC_ODC15_LENGTH                       0x00000001

#define _ODCD_ODD0_POSITION                      0x00000000
#define _ODCD_ODD0_MASK                          0x00000001
#define _ODCD_ODD0_LENGTH                        0x00000001

#define _ODCD_ODD1_POSITION                      0x00000001
#define _ODCD_ODD1_MASK                          0x00000002
#define _ODCD_ODD1_LENGTH                        0x00000001

#define _ODCD_ODD2_POSITION                      0x00000002
#define _ODCD_ODD2_MASK                          0x00000004
#define _ODCD_ODD2_LENGTH                        0x00000001

#define _ODCD_ODD3_POSITION                      0x00000003
#define _ODCD_ODD3_MASK                          0x00000008
#define _ODCD_ODD3_LENGTH                        0x00000001

#define _ODCD_ODD4_POSITION                      0x00000004
#define _ODCD_ODD4_MASK                          0x00000010
#define _ODCD_ODD4_LENGTH                        0x00000001

#define _ODCD_ODD5_POSITION                      0x00000005
#define _ODCD_ODD5_MASK                          0x00000020
#define _ODCD_ODD5_LENGTH                        0x00000001

#define _ODCD_ODD6_POSITION                      0x00000006
#define _ODCD_ODD6_MASK                          0x00000040
#define _ODCD_ODD6_LENGTH                        0x00000001

#define _ODCD_ODD7_POSITION                      0x00000007
#define _ODCD_ODD7_MASK                          0x00000080
#define _ODCD_ODD7_LENGTH                        0x00000001

#define _ODCD_ODD8_POSITION                      0x00000008
#define _ODCD_ODD8_MASK                          0x00000100
#define _ODCD_ODD8_LENGTH                        0x00000001

#define _ODCD_ODD9_POSITION                      0x00000009
#define _ODCD_ODD9_MASK                          0x00000200
#define _ODCD_ODD9_LENGTH                        0x00000001

#define _ODCD_ODD10_POSITION                     0x0000000A
#define _ODCD_ODD10_MASK                         0x00000400
#define _ODCD_ODD10_LENGTH                       0x00000001

#define _ODCD_ODD11_POSITION                     0x0000000B
#define _ODCD_ODD11_MASK                         0x00000800
#define _ODCD_ODD11_LENGTH                       0x00000001

#define _ODCD_ODD12_POSITION                     0x0000000C
#define _ODCD_ODD12_MASK                         0x00001000
#define _ODCD_ODD12_LENGTH                       0x00000001

#define _ODCD_ODD13_POSITION                     0x0000000D
#define _ODCD_ODD13_MASK                         0x00002000
#define _ODCD_ODD13_LENGTH                       0x00000001

#define _ODCD_ODD14_POSITION                     0x0000000E
#define _ODCD_ODD14_MASK                         0x00004000
#define _ODCD_ODD14_LENGTH                       0x00000001

#define _ODCD_ODD15_POSITION                     0x0000000F
#define _ODCD_ODD15_MASK                         0x00008000
#define _ODCD_ODD15_LENGTH                       0x00000001

